#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
module.eventBridgeRule0.aws_lambda_permission.lambda-trigger: Refreshing state... [id=lambda-trigger-20220517233759990200000005]
module.eventBridgeRule0.aws_cloudwatch_event_rule.cron-job: Refreshing state... [id=twitter-search-20220517233759738000000001]
module.eventBridgeRule0.aws_cloudwatch_event_target.cron-json: Refreshing state... [id=twitter-search-20220517233759738000000001-terraform-20220517233759991400000006]
module.twitter-bot-lambda.aws_cloudwatch_log_group.twitter-auth-cloudwatch: Refreshing state... [id=/aws/lambda/twitter-bot-lambda]
module.dynamoDB.aws_dynamodb_table.twitter-history-db: Refreshing state... [id=twitter-history]
module.authorisation-lambda.aws_apigatewayv2_api.twitter-auth-api-gateway: Refreshing state... [id=pw7fshn6z7]
module.dynamoDB.aws_dynamodb_table.twitter-auth-db: Refreshing state... [id=twitter-auth]
module.eventBridgeRule2.aws_cloudwatch_event_rule.cron-job: Refreshing state... [id=twitter-search-20220517234211222200000001]
module.authorisation-lambda.aws_cloudwatch_log_group.twitter-auth-cloudwatch: Refreshing state... [id=/aws/lambda/twitter-auth-lambda]
module.eventBridgeRule1.aws_cloudwatch_event_rule.cron-job: Refreshing state... [id=twitter-search-20220517233759738000000002]
module.twitter-bot-lambda.aws_iam_role.iam-role-twitter-bot-lambda: Refreshing state... [id=iam-role-twitter-bot-lambda]
module.authorisation-lambda.aws_iam_role.iam-role-authorisation-lambda: Refreshing state... [id=iam-role-authorisation-lambda]
module.authorisation-lambda.aws_apigatewayv2_stage.twitter-auth-api-gateway-stage: Refreshing state... [id=$default]
module.authorisation-lambda.aws_iam_policy.cloudwatch-policy: Refreshing state... [id=arn:aws:iam::388331548819:policy/twitter-authorisation-cloudwatch]
module.dynamoDB.aws_iam_policy.dynamoDB-read-write-access-policy: Refreshing state... [id=arn:aws:iam::388331548819:policy/dynamoDB-read-write-access-policy]
module.twitter-bot-lambda.aws_iam_policy.cloudwatch-policy: Refreshing state... [id=arn:aws:iam::388331548819:policy/twitter-bot-cloudwatch]
module.authorisation-lambda.aws_iam_policy.invoke-api-gateway-policy: Refreshing state... [id=arn:aws:iam::388331548819:policy/invoke-api-gateway-policy]
module.dynamoDB.aws_iam_policy_attachment.dynamoDB-read-write-access-policy-attachment: Refreshing state... [id=dynamoDB-read-write-access]
module.authorisation-lambda.aws_iam_policy_attachment.cloudwatch-policy-attachment: Refreshing state... [id=twitter-authorisation-cloudwatch]
module.authorisation-lambda.aws_lambda_function.twitter-authorisation-lambda: Refreshing state... [id=twitter-auth-lambda]
module.twitter-bot-lambda.aws_iam_policy_attachment.cloudwatch-policy-attachment: Refreshing state... [id=twitter-bot-cloudwatch]
module.twitter-bot-lambda.aws_lambda_function.twitter-bot-lambda: Refreshing state... [id=twitter-bot-lambda]
module.authorisation-lambda.aws_iam_policy_attachment.invoke-api-gateway-policy-attachment: Refreshing state... [id=invoke-api-gateway]
module.eventBridgeRule1.aws_lambda_permission.lambda-trigger: Refreshing state... [id=lambda-trigger-20220517233759982200000003]
module.eventBridgeRule1.aws_cloudwatch_event_target.cron-json: Refreshing state... [id=twitter-search-20220517233759738000000002-terraform-20220517233759983100000004]
module.eventBridgeRule2.aws_lambda_permission.lambda-trigger: Refreshing state... [id=lambda-trigger-20220517234211468400000002]
module.eventBridgeRule2.aws_cloudwatch_event_target.cron-json: Refreshing state... [id=twitter-search-20220517234211222200000001-terraform-20220517234211469500000003]
module.authorisation-lambda.aws_apigatewayv2_integration.twitter-auth-api-gateway-lambda-integration: Refreshing state... [id=8sq64tk]
module.authorisation-lambda.aws_lambda_permission.api-gateway-lambda-permission: Refreshing state... [id=APIGatewayToLambda]
module.authorisation-lambda.aws_apigatewayv2_route.twitter-auth-api-gateway-refresh-route: Refreshing state... [id=5qjtwor]
module.authorisation-lambda.aws_apigatewayv2_route.twitter-auth-api-gateway-token-route: Refreshing state... [id=avfb6rd]
module.authorisation-lambda.aws_apigatewayv2_route.twitter-auth-api-gateway-authorise-route: Refreshing state... [id=kw7ncm6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.eventBridgeRule0.aws_cloudwatch_event_rule.cron-job will be destroyed
  # (because aws_cloudwatch_event_rule.cron-job is not in configuration)
  - resource "aws_cloudwatch_event_rule" "cron-job" {
      - arn                 = "arn:aws:events:eu-west-2:388331548819:rule/twitter-search-20220517233759738000000001" -> null
      - description         = "Twitter bot search term: %23BlackInTech apply now -is:retweet" -> null
      - event_bus_name      = "default" -> null
      - id                  = "twitter-search-20220517233759738000000001" -> null
      - is_enabled          = true -> null
      - name                = "twitter-search-20220517233759738000000001" -> null
      - name_prefix         = "twitter-search-" -> null
      - schedule_expression = "cron(00 12 * * ? *)" -> null
      - tags                = {} -> null
      - tags_all            = {} -> null
    }

  # module.eventBridgeRule0.aws_cloudwatch_event_target.cron-json will be destroyed
  # (because aws_cloudwatch_event_target.cron-json is not in configuration)
  - resource "aws_cloudwatch_event_target" "cron-json" {
      - arn            = "arn:aws:lambda:eu-west-2:388331548819:function:twitter-bot-lambda" -> null
      - event_bus_name = "default" -> null
      - id             = "twitter-search-20220517233759738000000001-terraform-20220517233759991400000006" -> null
      - input          = jsonencode(
            {
              - query = "%23BlackInTech apply now -is:retweet"
            }
        ) -> null
      - rule           = "twitter-search-20220517233759738000000001" -> null
      - target_id      = "terraform-20220517233759991400000006" -> null
    }

  # module.eventBridgeRule0.aws_lambda_permission.lambda-trigger will be destroyed
  # (because aws_lambda_permission.lambda-trigger is not in configuration)
  - resource "aws_lambda_permission" "lambda-trigger" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "twitter-bot-lambda" -> null
      - id                  = "lambda-trigger-20220517233759990200000005" -> null
      - principal           = "events.amazonaws.com" -> null
      - source_arn          = "arn:aws:events:eu-west-2:388331548819:rule/twitter-search-20220517233759738000000001" -> null
      - statement_id        = "lambda-trigger-20220517233759990200000005" -> null
      - statement_id_prefix = "lambda-trigger-" -> null
    }

  # module.eventBridgeRule1.aws_cloudwatch_event_rule.cron-job will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "cron-job" {
      ~ description         = "Twitter bot search term: %23BlackTechTwitter apply now -is:retweet" -> "Twitter bot search term: %23BlackInTech apply now -is:retweet"
        id                  = "twitter-search-20220517233759738000000002"
        name                = "twitter-search-20220517233759738000000002"
      ~ schedule_expression = "cron(00 15 * * ? *)" -> "cron(00 06 * * ? *)"
        tags                = {}
        # (5 unchanged attributes hidden)
    }

  # module.eventBridgeRule1.aws_cloudwatch_event_target.cron-json will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "cron-json" {
        id             = "twitter-search-20220517233759738000000002-terraform-20220517233759983100000004"
      ~ input          = jsonencode(
          ~ {
              ~ query = "%23BlackTechTwitter apply now -is:retweet" -> "%23BlackInTech apply now -is:retweet"
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.eventBridgeRule2.aws_cloudwatch_event_rule.cron-job will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "cron-job" {
      ~ description         = "Twitter bot search term: %23BlackWomenInTech apply now -is:retweet" -> "Twitter bot search term: %23BlackTechTwitter apply now -is:retweet"
        id                  = "twitter-search-20220517234211222200000001"
        name                = "twitter-search-20220517234211222200000001"
      ~ schedule_expression = "cron(00 18 * * ? *)" -> "cron(00 09 * * ? *)"
        tags                = {}
        # (5 unchanged attributes hidden)
    }

  # module.eventBridgeRule2.aws_cloudwatch_event_target.cron-json will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "cron-json" {
        id             = "twitter-search-20220517234211222200000001-terraform-20220517234211469500000003"
      ~ input          = jsonencode(
          ~ {
              ~ query = "%23BlackWomenInTech apply now -is:retweet" -> "%23BlackTechTwitter apply now -is:retweet"
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.eventBridgeRule3.aws_cloudwatch_event_rule.cron-job will be created
  + resource "aws_cloudwatch_event_rule" "cron-job" {
      + arn                 = (known after apply)
      + description         = "Twitter bot search term: %23BlackWomenInTech apply now -is:retweet"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = (known after apply)
      + name_prefix         = "twitter-search-"
      + schedule_expression = "cron(00 12 * * ? *)"
      + tags_all            = (known after apply)
    }

  # module.eventBridgeRule3.aws_cloudwatch_event_target.cron-json will be created
  + resource "aws_cloudwatch_event_target" "cron-json" {
      + arn            = "arn:aws:lambda:eu-west-2:388331548819:function:twitter-bot-lambda"
      + event_bus_name = "default"
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + query = "%23BlackWomenInTech apply now -is:retweet"
            }
        )
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.eventBridgeRule3.aws_lambda_permission.lambda-trigger will be created
  + resource "aws_lambda_permission" "lambda-trigger" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "twitter-bot-lambda"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = "lambda-trigger-"
    }

  # module.eventBridgeRule4.aws_cloudwatch_event_rule.cron-job will be created
  + resource "aws_cloudwatch_event_rule" "cron-job" {
      + arn                 = (known after apply)
      + description         = "Twitter bot search term: apply from:codingblackfems -is:retweet"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = (known after apply)
      + name_prefix         = "twitter-search-"
      + schedule_expression = "cron(00 15 * * ? *)"
      + tags_all            = (known after apply)
    }

  # module.eventBridgeRule4.aws_cloudwatch_event_target.cron-json will be created
  + resource "aws_cloudwatch_event_target" "cron-json" {
      + arn            = "arn:aws:lambda:eu-west-2:388331548819:function:twitter-bot-lambda"
      + event_bus_name = "default"
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + query = "apply from:codingblackfems -is:retweet"
            }
        )
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.eventBridgeRule4.aws_lambda_permission.lambda-trigger will be created
  + resource "aws_lambda_permission" "lambda-trigger" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "twitter-bot-lambda"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = "lambda-trigger-"
    }

  # module.eventBridgeRule5.aws_cloudwatch_event_rule.cron-job will be created
  + resource "aws_cloudwatch_event_rule" "cron-job" {
      + arn                 = (known after apply)
      + description         = "Twitter bot search term: apply from:codefirstgirls -is:retweet"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = (known after apply)
      + name_prefix         = "twitter-search-"
      + schedule_expression = "cron(00 18 * * ? *)"
      + tags_all            = (known after apply)
    }

  # module.eventBridgeRule5.aws_cloudwatch_event_target.cron-json will be created
  + resource "aws_cloudwatch_event_target" "cron-json" {
      + arn            = "arn:aws:lambda:eu-west-2:388331548819:function:twitter-bot-lambda"
      + event_bus_name = "default"
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + query = "apply from:codefirstgirls -is:retweet"
            }
        )
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.eventBridgeRule5.aws_lambda_permission.lambda-trigger will be created
  + resource "aws_lambda_permission" "lambda-trigger" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "twitter-bot-lambda"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = "lambda-trigger-"
    }

  # module.eventBridgeRule6.aws_cloudwatch_event_rule.cron-job will be created
  + resource "aws_cloudwatch_event_rule" "cron-job" {
      + arn                 = (known after apply)
      + description         = "Twitter bot search term: apply from:btpipeline -is:retweet"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = (known after apply)
      + name_prefix         = "twitter-search-"
      + schedule_expression = "cron(00 21 * * ? *)"
      + tags_all            = (known after apply)
    }

  # module.eventBridgeRule6.aws_cloudwatch_event_target.cron-json will be created
  + resource "aws_cloudwatch_event_target" "cron-json" {
      + arn            = "arn:aws:lambda:eu-west-2:388331548819:function:twitter-bot-lambda"
      + event_bus_name = "default"
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + query = "apply from:btpipeline -is:retweet"
            }
        )
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.eventBridgeRule6.aws_lambda_permission.lambda-trigger will be created
  + resource "aws_lambda_permission" "lambda-trigger" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "twitter-bot-lambda"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = "lambda-trigger-"
    }

Plan: 12 to add, 4 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @MugishaU, Action: `pull_request`*